transfer-transaction-logs-list/src/test/resources/templates/request.vm

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sch="http://itau.com.co/services/support/transfertransactionlog/v1/schemas" xmlns:sch1="http://itau.com.co/commoncannonical/v2/schemas">
   <soapenv:Header/>
   <soapenv:Body>
      <sch:getTransferTransactionLogListRq>
         <sch:HeaderRequest xmlns:ns1="http://itau.com.co/services/common/auditory/v2/schemas" xmlns="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sch="http://itau.com.co/services/support/transfertransactionlog/v1/schemas">
            <sch1:MessageHeader xmlns:sch1="http://itau.com.co/commoncannonical/v2/schemas">
               <sch1:MessageKey>
                  <sch1:integrationId/>
                  <sch1:requestVersion/>
                  <sch1:requestUUID>$!{headers.requestUUID}</sch1:requestUUID>
               </sch1:MessageKey>
               <sch1:MessageInfo>
                  <sch1:dateTime>$!{headers.dateTime}</sch1:dateTime>
                  <sch1:systemId/>
                  <sch1:originatorName>$!{headers.originatorName}</sch1:originatorName>
                  <sch1:originatorType>$!{headers.originatorType}</sch1:originatorType>
                  <sch1:terminalId>$!{headers.terminalId}</sch1:terminalId>
                  <sch1:terminalType/>
                  <sch1:bankIdType/>
                  <sch1:bankId/>
                  <sch1:trnType></sch1:trnType>
               </sch1:MessageInfo>
               <sch1:TrnInfoList>
                  <!--Zero or more repetitions:-->
                  <sch1:TrnInfo>
                     <sch1:trnCode/>
                     <sch1:trnSrc/>
                  </sch1:TrnInfo>
               </sch1:TrnInfoList>
            </sch1:MessageHeader>
            <sch1:User xmlns:sch1="http://itau.com.co/commoncannonical/v2/schemas">
               <sch1:userName>$!{headers.servicioUsername}</sch1:userName>
               <sch1:userToken/>
               <sch1:employeeIdentlNum>$!{headers.servicioPassword}</sch1:employeeIdentlNum>
            </sch1:User>
         </sch:HeaderRequest>
         <sch:CustId>
            <!--Optional:-->
            <sch1:SPName></sch1:SPName>
            <!--Optional:-->
            <sch1:custPermId>$!{headers.custPermId}</sch1:custPermId>
            <!--Optional:-->
            <sch1:custLoginId></sch1:custLoginId>
            <!--Optional:-->
            <sch1:custType>$!{headers.custType}</sch1:custType>
         </sch:CustId>
         <sch:trnSubType>$!{headers.trnSubType}</sch:trnSubType>
         <sch:maxRec>$!{headers.maxRec}</sch:maxRec>
      </sch:getTransferTransactionLogListRq>
   </soapenv:Body>
</soapenv:Envelope>